#### 2024.9.15

**今日学习：
（62）清洗数据·前提（63）清洗数据·索引&列名（64）清洗数据·乱数据**

ps：之前漏了（62）清洗数据·前提，学习后发现只是一个基础介绍，在此并不进行笔记记录

In [1]:
import pandas as pd

#### 一、清洗数据.索引&列名

**（1）手动清洗·索引&列名:**

        如果在读取数据后发现数据的索引or列名存在混乱时，可以使用DataFrame的rename方法
                重命名索引：df.rename(index={···})
                重命名列名：df.rename(columns={···})

In [2]:
s_name = pd.Series(["沃玛", "憨色", "冷鸟", "吴优"], index=["01", "002", "03", "0004"])
s_sex = pd.Series(["女", "女", "女", "男"], index=["01", "002", "03", "0004"])
s_height = pd.Series([160.0, 158.5, 162.2, 172.5], index=["01", "002", "03", "0004"])
s_grade = pd.Series([100, 90, 80, 66], index=["01", "002", "03", "0004"])

df_1 = pd.DataFrame({"姓名":s_name, "性别":s_sex, "身高":s_height, "成绩":s_grade})
df_1

      姓名 性别     身高   成绩
01    沃玛  女  160.0  100
002   憨色  女  158.5   90
03    冷鸟  女  162.2   80
0004  吴优  男  172.5   66

In [3]:
df_1.rename(index={"002":"02","0004":"04"})    # 花括号{}中分别放入 需要修改&修改后的值

    姓名 性别     身高   成绩
01  沃玛  女  160.0  100
02  憨色  女  158.5   90
03  冷鸟  女  162.2   80
04  吴优  男  172.5   66

In [4]:
df_1    # 即使rename后，原始df_1的序列并未修改，需要自己调用 =
        # columns用法也是一致

      姓名 性别     身高   成绩
01    沃玛  女  160.0  100
002   憨色  女  158.5   90
03    冷鸟  女  162.2   80
0004  吴优  男  172.5   66

**（2）自动清洗·索引&列名:**

        如果需要清洗的索引&列名很多，手动一个个输入清洗很麻烦，可以将字典{}换成 函数or方法
                该函数&方法就是将索引or列名作为参数：大写所有名称：str.upper----str是Series自带的一个属性
                                                       具体关于其他str方法可在pandas官网进行查看

In [5]:
df_1.rename(columns=str.upper)    # 调用后将列名进行大写

      姓名 性别     身高   成绩
01    沃玛  女  160.0  100
002   憨色  女  158.5   90
03    冷鸟  女  162.2   80
0004  吴优  男  172.5   66

**（3）将某列设为索引:**

        如果需要将其中一列的值替换索引，可以使用.set_index()方法
                修改索引为列名后，如果想修改回默认索引，则可以使用.reset_index()方法

In [6]:
df_2 = df_1.set_index("姓名")
df_2

   性别     身高   成绩
姓名
沃玛  女  160.0  100
憨色  女  158.5   90
冷鸟  女  162.2   80
吴优  男  172.5   66

In [7]:
df_2.reset_index()    # 修改回默认索引

   姓名 性别     身高   成绩
0  沃玛  女  160.0  100
1  憨色  女  158.5   90
2  冷鸟  女  162.2   80
3  吴优  男  172.5   66

**(4）将索引&列名重新排序:**

        调用df.sort_index()可以对索引or列名进行排序
                默认axis=0，是沿着索引纵向操作，即对索引进行排序；指定axis=1，是对列名排序

In [8]:
df_1.sort_index()    # 注意：该调用同样不会改变原始DataFrame

      姓名 性别     身高   成绩
0004  吴优  男  172.5   66
002   憨色  女  158.5   90
01    沃玛  女  160.0  100
03    冷鸟  女  162.2   80

In [9]:
df_1.sort_index(inplace=True)    # 如果想修改原始DataFrame，不仅可以通过赋值=，也可以添加参数 inplace=True
df_1

      姓名 性别     身高   成绩
0004  吴优  男  172.5   66
002   憨色  女  158.5   90
01    沃玛  女  160.0  100
03    冷鸟  女  162.2   80

==============================================================================

#### 二、清洗数据·乱数据

**（1）清洗数据内容·乱:**

        根据数据的结构划分为 乱数据&整洁数据
                1.转置数据结构：df.T
                2.拆分列（多个属性构成一列）：str.split("拆分值")----同python中的.split()方法一样，根据指定分隔符拆分内容
                3.将不同列组合成一列：str.cat()

In [10]:
s_name = pd.Series(["沃/玛", "憨/色", "冷/鸟", "吴/优"], index=["01", "02", "03", "04"])
s_sex = pd.Series(["女", "女", "女", "男"], index=["01", "02", "03", "04"])
s_height = pd.Series([160.0, 158.5, 162.2, 172.5], index=["01", "02", "03", "04"])
s_grade = pd.Series([100, 90, 80, 66], index=["01", "02", "03", "04"])

df_3 = pd.DataFrame({"姓名":s_name, "性别":s_sex, "身高":s_height, "成绩":s_grade})
df_3

     姓名 性别     身高   成绩
01  沃/玛  女  160.0  100
02  憨/色  女  158.5   90
03  冷/鸟  女  162.2   80
04  吴/优  男  172.5   66

In [11]:
df_3["姓名"].str.split("/")    # 即根据 "/"分隔符对姓名列进行拆分----但这样只能表达将值拆分为一个[]的效果，并非达到拆分为两列的效果

01    [沃, 玛]
02    [憨, 色]
03    [冷, 鸟]
04    [吴, 优]
Name: 姓名, dtype: object

In [12]:
df_3["姓名"].str.split("/",expand=True)    # 如果想要根据分隔符将一列数据拆分为两列，需要传入参数 expand=True ，表示将拆分后的值表示为两个Series

    0  1
01  沃  玛
02  憨  色
03  冷  鸟
04  吴  优

In [13]:
df_3[["姓", "名"]] = df_3["姓名"].str.split("/",expand=True)    # 赋值后添加了两列指定的 Series----但如果指定的列名存在即为更新列
df_3                                                           # 但此时老Series并未被删除

     姓名 性别     身高   成绩  姓  名
01  沃/玛  女  160.0  100  沃  玛
02  憨/色  女  158.5   90  憨  色
03  冷/鸟  女  162.2   80  冷  鸟
04  吴/优  男  172.5   66  吴  优

In [14]:
df_3 = df_3.drop("姓名", axis=1)    # 删除列 "姓名"，由于"姓名"是列名，因此还需要指定axis=1
df_3

   性别     身高   成绩  姓  名
01  女  160.0  100  沃  玛
02  女  158.5   90  憨  色
03  女  162.2   80  冷  鸟
04  男  172.5   66  吴  优

In [15]:
df_3["姓"].str.cat(df_3["名"])    # 使用str.cat()拼接不同列

01    沃玛
02    憨色
03    冷鸟
04    吴优
Name: 姓, dtype: object

In [16]:
df_3["姓"].str.cat(df_3["名"],sep="-")    # 还可以调用 sep="-"，用来指定拼接值时的分隔符

01    沃-玛
02    憨-色
03    冷-鸟
04    吴-优
Name: 姓, dtype: object

**（2）将宽数据转换为长数据:**

        实质是将一部分列名的值转换为变量的值，如将DGP·Q1、DGP·Q2、DGP·Q3、DGP·Q4转换为GDP为列名，Q1234分别为其值
                可以调用pd.melt()方法：pd.melt(df_1, id_vars=["保留列名1", "保留列名2"],
                                            var_name="转换后的列名",  value_name="数值列名")

In [17]:
# pd.melt(df_GDP, id_vars=["国家 ", "年份 "],
#        var_name="GDP",  value_name="数值")

        由于没有具体df数据，看起来有些奇怪

**（3）对行进行拆分:**

        如某列的值为是一个列表，而不是独立的值，可以调用.explode("列名")方法将该列中的元素转换为单独一行的DataFrame

In [18]:
s_name = pd.Series(["沃玛", "憨色", "冷鸟", "吴优"], index=["01", "02", "03", "04"])
s_class = pd.Series([["数学", "英语"], ["英语"], ["数学", "音乐"], ["体育", "英语", "语文"]], index=["01", "02", "03", "04"])

df_4 = pd.DataFrame({"姓名":s_name, "课程":s_class})
df_4

    姓名            课程
01  沃玛      [数学, 英语]
02  憨色          [英语]
03  冷鸟      [数学, 音乐]
04  吴优  [体育, 英语, 语文]

In [19]:
df_4.explode("课程")    # 将"课程"中的每个元素转换为单独的一行

    姓名  课程
01  沃玛  数学
01  沃玛  英语
02  憨色  英语
03  冷鸟  数学
03  冷鸟  音乐
04  吴优  体育
04  吴优  英语
04  吴优  语文

 **（4）对行or列进行删除:**

        使用.drop()方法，不指定axis时，默认对序列进行操作
                同样可以指定一个[]删除多个行or列，如df_4.drop(["02","04"])

In [20]:
df_4.drop("02")    # 删除序列为 "02"的行

    姓名            课程
01  沃玛      [数学, 英语]
03  冷鸟      [数学, 音乐]
04  吴优  [体育, 英语, 语文]

In [21]:
df_4.drop("姓名", axis=1)    # 指定axis=1，删除列

              课程
01      [数学, 英语]
02          [英语]
03      [数学, 音乐]
04  [体育, 英语, 语文]

In [22]:
df_4.drop(["02","04"])    # 传入[]删除多行or列

    姓名        课程
01  沃玛  [数学, 英语]
03  冷鸟  [数学, 音乐]